lib/tasks/dev.rake

SELECT  "mining_types".* FROM "mining_types" WHERE "mining_types"."acronym" = ? LIMIT ?  [["acronym", "PoW"], ["LIMIT", 1]]
SELECT "mining_types".* FROM "mining_types"
SELECT  "coins".* FROM "coins" WHERE "coins"."description" = ? AND "coins"."acronym" = ? AND "coins"."url_image" = ? LIMIT ?  [["description", "Bitcoin"], ["acronym", "BTC"], ["url_image", "https://static.vecteezy.com/system/resources/previews/008/505/801/original/bitcoin-logo-color-illustration-png.png"], ["LIMIT", 1]]
INSERT INTO "coins" ("description", "acronym", "url_image", "created_at", "updated_at", "mining_type_id") VALUES (?, ?, ?, ?, ?, ?)
---
  task add_coins: :environment do
    show_spinner("Cadastrando as moedas ...") do # importante colocar o do aqui e end no final, já que não tem uma instrução no terminal como no caso da liha 5:7 com {}
      coins =  [
                  {description: "Bitcoin",
                  acronym: "BTC",
                  url_image: "https://static.vecteezy.com/system/resources/previews/008/505/801/original/bitcoin-logo-color-illustration-png.png",
                  mining_type: MiningType.find_by(acronym: 'PoW')}, # o where não funciona pq retorna um array. find só aceita informar o id

                  {description: "Ethereum",
                  acronym: "ETH",
                  url_image: "https://upload.wikimedia.org/wikipedia/commons/thumb/0/05/Ethereum_logo_2014.svg/1257px-Ethereum_logo_2014.svg.png",
                  mining_type: MiningType.all.sample},

                  {description: "Dash",
                  acronym: "DASH",
                  url_image: "https://cdn.icon-icons.com/icons2/2699/PNG/512/dash_logo_icon_170297.png",
                  mining_type: MiningType.all.sample},

                  {description: "Iota",
                  acronym: "IOT",
                  url_image: "https://s2.coinmarketcap.com/static/img/coins/200x200/1720.png",
                  mining_type: MiningType.all.sample},

                  {description: "ZCash",
                  acronym: "ZEC",
                  url_image: "https://s2.coinmarketcap.com/static/img/coins/200x200/1437.png",
                  mining_type: MiningType.all.sample}
                ]

      coins.each do |coin|
        Coin.find_or_create_by!(coin)

INSERT INTO "mining_types" ("description", "acronym", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "Proof of Work"], ["acronym", "PoW"], ["created_at", "2023-10-17 18:21:24.245237"], ["updated_at", "2023-10-17 18:21:24.245237"]]
---
  task add_mining_types: :environment do
    show_spinner("Cadastrando os tipos de mineração ...") do
      mining_types =  [
                  {description: "Proof of Work", acronym: "PoW"},
                  {description: "Proof of Stake", acronym: "PoS"},
                  {description: "Proof of Capacity", acronym: "PoC"}
                ]

      mining_types.each do |mining_type|
        MiningType.find_or_create_by!(mining_type)